<a href="https://colab.research.google.com/github/sabsabb/Python-Pandas/blob/main/Pandas_02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Pemilihan baris (rows selection) pada Data Frame**

Import Library

In [8]:
import pandas as pd
import numpy as np

Persiapan Data Frame

In [9]:
n_rows = 10
n_cols = 5

cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,5,size=(n_rows,n_cols)), columns=cols)
#randint berfungsi untuk mengambil data integer secara random dengan rentang nilai 1-5
df

   A  B  C  D  E
0  1  3  2  1  3
1  3  3  2  2  4
2  3  3  4  1  4
3  3  2  4  2  1
4  4  1  2  3  3
5  3  4  2  1  2
6  2  1  1  3  1
7  1  1  4  1  3
8  3  1  2  1  3
9  2  4  4  2  2

Selection dengan logika OR ( | )

In [10]:
df[(df['A']==1) | (df['A']==2)]

   A  B  C  D  E
0  1  3  2  1  3
6  2  1  1  3  1
7  1  1  4  1  3
9  2  4  4  2  2

Selection dengan fungsi isin()

In [13]:
#fungsi isin() sama dengan penggunaan ( | )
df[df['A'].isin([1,2])]

   A  B  C  D  E
0  1  3  2  1  3
6  2  1  1  3  1
7  1  1  4  1  3
9  2  4  4  2  2

Penggunaan Operator Negasi (~)

In [14]:
df[~df['A'].isin([1,2])]

   A  B  C  D  E
1  3  3  2  2  4
2  3  3  4  1  4
3  3  2  4  2  1
4  4  1  2  3  3
5  3  4  2  1  2
8  3  1  2  1  3